ADD_PRODUCT="Додати продукт"
ASSORTMENT="Асортимент"
EDIT_BANNER="Додати / редагувати банер"
ACTION="Виберіть дію"
WELCOME="Привіт! Що ви хочете зробити?"
EMPTY_LIST="Список продуктів порожній. Продуктів немає."
DELETE="Видалити"
EDIT="Редагувати"
LIST="Список продуктів ⏫"
DELETE_PROD="Продукт видалено"
SEND_BANNER_PHOTO="Надішліть фото банера.\nУ підписі вкажіть сторінку:\n{', '.join(pages_names)}"
VALID_NAME="Введіть дійсну назву сторінки, наприклад:\n{', '.join(pages_names)}"
ADDED_BANNER="Банер додано/змінено."
ACTION_CANCELED="Дію скасовано"
SEND_PHOTO_OR_CANCEL="Надішліть фото банера або скасуйте"

TEXT = {
    "AddProduct:name": "Введіть назву знову:",
    "AddProduct:description": "Введіть опис знову:",
    "AddProduct:category": "Оберіть категорію знову ⬆️",
    "AddProduct:price": "Введіть ціну знову:",
    "AddProduct:image": "Це останній стан, тому...",
}

ENTER_PROD_NAME = "Введіть назву продукту.\nНатисніть . для пропуску зміни назви."
PREVIOUS_STEP='Попереднього кроку не існує, або введіть назву продукту, або напишіть "cancel".'
BACK_TO_STEP="Гаразд, ви повернулися до попереднього кроку \n {AddProduct.texts[previous.state]}"
VALUE_PRODUCT_NAME="Назва продукту не повинна перевищувати 150 символів або бути менше 3 символів.\nБудь ласка, введіть її знову."
DESCRIPTION="Введіть опис.\nНатисніть . для пропуску зміни опису."
INVALID_DATA="Ви ввели невірні дані, будь ласка, введіть текст назви продукту"
VALID_DESCRIPTION="Опис не повинен перевищувати 1500 символів або бути менше 5 символів.\nБудь ласка, введіть його знову."
SELECT_CATEGORY="Оберіть категорію"
INVALID_DESCRIPTION="Ви ввели невірні дані, будь ласка, введіть текст опису продукту"
PRODUCT_PRICE="Введіть ціну продукту.\nНатисніть . для пропуску зміни ціни."
SELECT_BUTTON_1="Оберіть категорію з кнопок 1"
SELECT_BUTTON_2="Оберіть категорію з кнопок 2"
CORRECT_PRICE="Введіть вырне значення ціни"
UPLOAD_IMAGE="Завантажте фото продукту.\nНатисніть . для пропуску зміни фото."
INVALID_DATA="Ви ввели невірні дані, будь ласка, введіть текст ціни продукту"
SEND_PHOTO="Надішліть фото продукту"
ADDED_PRODUCT="Продукт додано/змінено"
ERROR="Помилка: \n{str(e)}\nЗверніться до розробника"
SEND_PHOTO="Надішліть фото продукту"
